"""Данные чатов: ранги, стоп-слова, каналы, медиа-запросы, реакции."""

RANKS = {
    10: "навичок 🌱",
    100: "влился в тусовку 🍻",
    500: "многа пиздит 🦜",
    1000: "хуятор 🔨",
    2000: "мягкий лобок 🍑",
    3000: "пидорок женщина 💅",
    4000: "онгличянен 🎩",
    5000: "мегахуятор ⚔️",
    6000: "гундосый пенис 👃",
    7000: "говночлен 🚽",
    8000: "великолепный гоша 🕺",
    9000: "шишка геморроя 🌲",
    10000: "серый кординал ♟️",
    20000: "местный автаритет ⭐",
    30000: "телеграм-герой ✈️",
    40000: "Хуй",
    50000: "ИИ 🤖",
    60000: "Никита 😎",
    70000: "Мистер Бин 🤵",
    80000: "Адольф 🦅",
    90000: "эксперт 🧐",
    100000: "Пидорас света и добра ✨🌈"
}


# Стоп-слова для статистики
STOPWORDS = {
            "а", "а именно", "аж", "б", 
            "благодаря", "будто", "бы", 
            "в", "ваш", "в то время как", "вблизи", "ввиду", "вдоль", "взамен", "включая", "вместо", "вне", "внизу", "внутри", "внутрь", "во", "вовнутрь", "возле", "вокруг", "вот", "впереди", "вплоть", "впоследствии", "впредь", "вразрез", "вроде", "вряд ли", "вполне", "всем", "всех", "вслед", "вследствие", "вы", "вышний", "выше", 
            "где", "да", "даже", 
            "да", "для", "до", "другой", 
            "его", "ей", "ему", "ее", "её", "если", "если бы", "ещё", "еще", 
            "же", 
            "за", "за исключением", "заодно", "зачем", "зато", "затем", 
            "и", "ибо", "из", "из-за", "изнутри", "из-под", "или", "именно", "их",
            "й",
            "к", "как", "какой", "когда", "кое", "ко", "кроме", "кстати", "кто", "куда", 
            "ли", "либо", "лишь", 
            "меня", "меж", "между", "мимо", "мне", "мой", "мы", 
            "на", "нам", "наверх", "навстречу", "над", "надо", "назад", "наместо", "насчет", "наследствие", "насквозь", "начиная", "наш", "не", "не то", "недалеко", "независимо", "некоторый", "нет", "нечто", "ни", "никакой", "никто", "ничто", "но", "ну", 
            "о", "около", "он", "она", "оно", "они", "однако", "от", "отдаленно", "откуда", "относительно", 
            "п", "по", "по аналогии", "по поводу", "по причине", "по отношению", "поверх", "пока", "покуда", "помимо", "потому", "потому что", "позади", "посередине", "после", "посреди", "посредством", "поскольку", "почему", "приблизительно", "при", "прежде", "применительно", "причем", "притом", "про", "пусть", "путем", 
            "разве", "рядом", 
            "с", "сверху", "сверх", "себя", "сквозь", "словно", "смотря", "спустя", "среди", "снаружи", "снизу", 
            "так", "там", "твой", "тебя", "тебе", "тем", "то", "то есть", "только", "только что", "тот", "тоже", "тут", "ты", 
            "у", "уж", 
            "х", "хотя", "хоть", 
            "чем", "через", "че", "чо", "что", "чтобы", "чуть", "это", "этот", 
            "я",
            "добавь", "ии", "найди", "нарисуй", "опиши", "очистка", "пародия", "пися", "пирожок", "плотва", "порошок", "упупа", "шма", "crocozyabrbot"
            }

# Словарь с настройками каналов
CHANNEL_SETTINGS = {
    "каты": {
        "url": "https://tgstat.ru/channel/@cats_cats",
        "reply_message": "Захожу в базу бляцких катов @cats_cats",
        "error_message": "Каты спят"
    },
    "люк": {
        "url": "https://tgstat.ru/channel/@lukeimyourmouth",
        "reply_message": "Ищу калом буры из @lukeimyourmouth",
        "error_message": "Люк спит"
    },
    "нейрорецепты": {
        "url": "https://tgstat.ru/channel/@neural_recipes",
        "reply_message": "Чего бы паесть необычнава",
        "error_message": "Нихуя"
    },
    "рецепты": {
        "url": "https://tgstat.ru/channel/@uhbla",
        "reply_message": "Чего бы паесть вкусненькова",
        "error_message": "Холодильник пуст"
    },
    "папуги": {
        "url": "https://tgstat.ru/channel/@papugi",
        "reply_message": "Ищу гошу пидораса в @papugi",
        "error_message": "Папуг улител"
    },
    "каламбур": {
        "urls": [
            "https://tgstat.ru/channel/@wbi_memes",
            "https://tgstat.ru/channel/@lingvodor",
            "https://tgstat.ru/channel/@lingvojokes"
        ],
        "reply_message": "Калом бурим скважыну",
        "error_message": "Хуй"
    }
}

# Настройки поиска животных
queries = {
    "кот": ("cat photography", "cat_image.jpg", "Хуёт"),
    "кошка": ("cute cat photography", "cat1_image.jpg", "Хуёшка"),
    "кот и кошка": ("couple of cats photography", "cat2_image.jpg", "Хуёт и хуёшка"),
    "котенок": ("cute kitty photography", "cat3_image.jpg", "Хуенок"),
    "выдра": ("cute otter photography", "otter_image.jpg", "хуидра"),
    "крол": ("cute rabbit photography", "rabbit_image.jpg", "говнёл"),
    "птичка": ("cute bird photography", "bird_image.jpg", "хуичка"),
    "змейка": ("cute snake photography", "snake_image.jpg", "говнейка"),
    "цобако": ("cute dog photography", "dog_image.jpg", "уебако"),
    "пес": ("cute dog photography", "dog2_image.jpg", "говнёс"),
    "жаба": ("toad photography", "toad_image.jpg", "говняба"),
    "лягушка": ("cute frog photography", "frog_image.jpg", "говнюшка"),
    "шиншилла": ("chinchilla photography", "shin_image.jpg", "хуила"),
    "опоссум": ("awesome opossum photography", "opossum_image.jpg", "говнёссум"),
    "рыбка": ("underwater photography fish close up", "fish_image.jpg", "Говнибка"),
    "носекомое": ("insect close up photography", "insect_image.jpg", "Хуекомое"),
    "белка": ("cute squirrel photography", "belka_image.jpg", "Говнелка"),
    "пчолка": ("bee cute photography", "bee_image.jpg", "Говнёлка"),
    "шмеле": ("bumblebee cute photography", "bumblebee_image.jpg", "Говнеле"),
    "сыч": ("cute owl photography", "owl_image.jpg", "Говнич"),
    "червяк": ("worm close up photography", "worm_image.jpg", "Говняк"),
    "фенек": ("fennec cute photography", "fenek_image.jpg", "Говнёк"), 
    "енот": ("racoon cute photography", "racoon_image.jpg", "Говнот"),
}

actions = [
    "typing",
    "upload_photo",
    "record_video",
    "upload_video",
    "record_voice",
    "upload_voice",
    "upload_document",
    "choose_sticker",
    "record_video_note",
    "upload_video_note"
]
